Autodesk.Revit.DB.Structure.AnalyticalModelSketchComponent.GetComponentElementId
Retrieves ElementId of Sketch Component, if such an operation makes sense.
Returns:
ElementId of Sketch Component.
If the operation does not make sense (perhaps because the Sketch abstraction does not
translate one-to-one to ElementIds), then this will return invalidElementId.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModelSketchComponent.GetAutoDetectMatchedElements
Retrieves ElementIds that Sketch Component is Auto-detecting against.
Remarks:
An empty set indicates that the Sketch Component is just not Auto-detecting against anything.
Returns:
Set of ElementIds that Sketch Component is auto-detecting against.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModelSketchComponent.SetAnalyticalProjectionDatumPlane(Autodesk.Revit.DB.ElementId)
Sets the Analytical Projection to supplied Datum Plane.
datumPlaneId:
Identifies Datum Plane ElementId.
Throws Autodesk.Revit.Exceptions.ArgumentException:
datumPlaneId is not valid for this Sketch Component.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModelSketchComponent.SetAnalyticalProjectionType(Autodesk.Revit.DB.Structure.AnalyticalProjectionType)
Sets the Analytical Projection to the supplied Analytical Projection Type.
projectionType:
Analytical Projection Type to which the Analytical Model should project.
Throws Autodesk.Revit.Exceptions.ArgumentException:
projectionType is not valid for this Sketch component.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModelSketchComponent.SetAnalyticalAlignmentMethod(Autodesk.Revit.DB.Structure.AnalyticalAlignmentMethod)
Sets the Alignment Method to the supplied Analytical Alignment Method
alignmentMethod:
Analytical Alignment Method which the Analytical Model should use for alignment.
Throws Autodesk.Revit.Exceptions.ArgumentException:
alignmentMethod is not valid for this Sketch component.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModelSketchComponent.IsValidDatumPlaneForProjection(Autodesk.Revit.DB.ElementId)
Indicates whether Datum Plane is valid Analytical Projection of Sketch Component.
datumPlaneId:
ElementId identifying Datum Plane.
Returns:
True if Datum Plane is valid; false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModelSketchComponent.IsValidAnalyticalProjectionType(Autodesk.Revit.DB.Structure.AnalyticalProjectionType)
Indicates whether Analytical Projection Type is valid for Sketch Component.
projectionType:
Analytical Projection Type preset to test for validity.
Returns:
True is projection type is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModelSketchComponent.IsValidAnalyticalAlignmentMethod(Autodesk.Revit.DB.Structure.AnalyticalAlignmentMethod)
Indicates whether Analytical Alignment Method is valid for Sketch Component.
alignmentMethod:
Analytical Alignment Method preset to test for validity.
Returns:
True means alignment method is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModelSketchComponent.GetAnalyticalProjectionDatumPlane
Retrieves Datum Plane ElementId for Analytical Projection
Returns:
Represents Datum used for Analytical Projection, if Analytical Projection Type indicates that a
Datum Plane is to be used.  Otherwise, invalidElementId is returned.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModelSketchComponent.GetAnalyticalProjectionType
Retrieves Analytical Projection Type preset for Sketch Component.
Returns:
Indicates whether Analytical Projection is at a preset, or refers to a Datum.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModelSketchComponent.GetAnalyticalAlignmentMethod
Retrieves Analytical Alignment Method preset for Sketch Component.
Returns:
Indicates whether Alignment Method is at Auto-Detect or Projection
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModelSketchComponent.EnableAutoDetect
Enables Auto-detect on Sketch Component.
Remarks:
To disable Auto-detect on Sketch Component, another method (SetAnalyticalAlignmentMethod) must be used
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModelSketchComponent.IsAutoDetectEnabled
Indicates whether Auto-detect is enabled on the given Sketch component.
Returns:
True if Auto-detect is enabled, false otherwise.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModelSketchComponent.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.AnalyticalModelSketchComponent
This is one component of an AnalyticalModelSketch, which exists to provide greater granularity over the Analytical Model than at the Element level.
Remarks:
This may or may not be a simple one-to-one mapping to ElementIds.  For instance, one Element
may be defined by multiple Curve Elements within a Sketch.  But another Element may not have
that designation, and the individual curves are not defined by any other Elements within a document.
Since:
2011